{
  "backend/main.mo": "Defines canister types and state for reviews, articles, bikes, comments, ratings, and brand data with access control and storage mixins, plus admin seeding logic for popular bikes.",
  "feature_evidence.json": "Lists feature evidence entries mapping feature requirements to affected frontend files and components with confidence levels.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of numerous frontend files describing their roles in routing, UI components, and pages.",
  "frontend/.deploy-retry-trigger": "Marker file indicating a retry deployment attempt triggered due to a previous generic deployment error.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation outlining steps for retrying deployments, validating success, and handling repeated failures.",
  "frontend/index.css": "Tailwind CSS configuration defining custom theme variables and base styles for light and dark modes.",
  "frontend/index.html": "Basic HTML entry point loading the React application via main.tsx.",
  "frontend/src/App.tsx": "Sets up the TanStack Router, defines all app routes, and wraps the app in ThemeProvider with toaster.",
  "frontend/src/components/AppFooter.tsx": "Footer component providing about info, category links, regions, social icons, and Caffeine.ai attribution.",
  "frontend/src/components/AppHeader.tsx": "Navigation header with logo, category links, region selector, search, auth button, and mobile menu support.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with region context and renders header, footer, routed content, and a profile setup dialog.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity with async handling and query cache clearing.",
  "frontend/src/components/BikeCard.tsx": "Displays a bike preview card with image, region badge, specs, price range, and navigation to bike details.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bikes including images, pricing, region, color options, brand logo, and markdown-based spec parsing.",
  "frontend/src/components/BikeImageGallery.tsx": "Image gallery with main image, navigation arrows, thumbnails, error fallback, and optional expand handling.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable selector for choosing a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category cards linking to category pages or comparisons with icons and descriptions.",
  "frontend/src/components/CommentsPanel.tsx": "Displays a comments section for a review with creation, deletion, and moderation actions, handling loading states and authentication.",
  "frontend/src/components/ComparisonTable.tsx": "Renders a side‑by‑side comparison of two bikes with specs and optional review scores, highlighting differences.",
  "frontend/src/components/ImageLightbox.tsx": "Provides a modal lightbox for browsing images with keyboard and button navigation and error fallback handling.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Shows recent launch articles in a looping carousel with titles, regions, excerpts, and navigation controls.",
  "frontend/src/components/LongFormContent.tsx": "Renders long-form text, sanitizing HTML or converting markdown-style headings into styled prose components.",
  "frontend/src/components/MobileToc.tsx": "Displays a collapsible mobile table of contents that highlights the active heading and supports navigation.",
  "frontend/src/components/ModerationMenu.tsx": "Provides a dropdown menu for admins or comment owners to hide or delete comments with a confirmation dialog.",
  "frontend/src/components/PaletteSwatchEditDialog.tsx": "Dialog for editing a hex color swatch with validation and live preview.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Forces new authenticated users to enter name and optional bio before continuing.",
  "frontend/src/components/RatingWidget.tsx": "Displays average review rating and allows authenticated users to submit star ratings.",
  "frontend/src/components/RegionFilter.tsx": "Tabs component for selecting a region filter including an 'all' option.",
  "frontend/src/components/RequireAuthAction.tsx": "Wrapper that prompts unauthenticated users to sign in before performing an action.",
  "frontend/src/components/RichTextEditor.tsx": "Custom rich text editor supporting images, captions, formatting, and paste sanitization.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows detailed score categories with progress bars and an overall rating badge.",
  "frontend/src/components/TableOfContents.tsx": "Renders a navigable list of page headings with active state highlighting.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches authenticated or anonymous backend actors, refreshing on identity change.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns current user's auth status, profile, and role based on identity and backend queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and login state using Dfinity's AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating articles, reviews, and related content via an actor API with success/error UI handling.",
  "frontend/src/hooks/useRegionContext.tsx": "Implements a React context for storing and updating the selected region, persisted in sessionStorage.",
  "frontend/src/hooks/useTableOfContents.ts": "Extracts page headings and tracks the active section using IntersectionObserver, exposing scroll-to-heading functionality.",
  "frontend/src/index.css": "Tailwind setup with custom CSS variables, theming, global styles, and content‑editable image and caption styling.",
  "frontend/src/main.tsx": "Bootstrap file that mounts the React app with QueryClient and InternetIdentity providers.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Renders an article detail view with TOC integration, loading states, metadata display, and navigation links.",
  "frontend/src/pages/BikeDetailPage.tsx": "Displays detailed information for a specific bike, including images, colors, price, and validation for invalid or missing IDs. Handles loading states, image lightbox, and navigation back to brands.",
  "frontend/src/pages/BrandDetailPage.tsx": "Shows all bikes for a selected brand with logo, loading states, and navigation back to the brands list. Filters bikes by brand and renders them in a grid.",
  "frontend/src/pages/BrandsPage.tsx": "Lists all motorcycle brands with search, logo aggregation, and bike counts. Generates a brand grid linking to brand detail pages.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Renders a specific buying guide with table of contents, metadata, quick checklist, and full article content. Handles loading and missing-guide states.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays articles or reviews for a selected category with region filtering and loading states. Sorts and shows content cards with region and score indicators.",
  "frontend/src/pages/ComparePage.tsx": "Allows users to select two bikes and compare them using a comparison table. Includes bike selectors, validation, and conditional rendering of comparison results.",
  "frontend/src/pages/CreateArticlePage.tsx": "Provides a form for authenticated users to create or save articles with fields for metadata and content, then navigates to the article or drafts list after submission.",
  "frontend/src/pages/CreateReviewPage.tsx": "Allows authenticated users to create or save motorcycle reviews with ratings, bike selection, pros/cons, and content, then redirects to the review or drafts list.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage sections including hero, latest launches, trending reviews, and category navigation using fetched articles, bikes, and reviews.",
  "frontend/src/pages/ManageBikesPage.tsx": "Enables authenticated users to create, edit, delete, and seed bike listings, showing a list of their bikes with admin seeding support.",
  "frontend/src/pages/MyDraftsPage.tsx": "Shows a user's draft articles and reviews with options to publish or navigate to create new content, requiring authentication.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a detailed review page with bike info, scoring, long-form content, and table of contents, loading data from review and bike queries.",
  "frontend/src/pages/SearchResultsPage.tsx": "Fetches articles, reviews, and bikes, then filters them by a search query to display grouped search results and matching brands.",
  "frontend/src/pages/SectionPalettesPage.tsx": "Provides a UI to create text-based sections that generate and edit color palettes derived from text or user-added hex codes.",
  "frontend/src/tiptap/extensions/ImageWithCaption.tsx": "Empty or placeholder file for a Tiptap extension handling images with captions.",
  "frontend/src/utils/markdownSpecs.ts": "Parses Markdown spec tables to extract formatted specs text plus optional price ranges and color lists with robust parsing helpers.",
  "frontend/src/utils/reviewFields.ts": "Utility functions converting review pros/cons between textarea and arrays and normalizing rating values to a 0–100 range.",
  "frontend/src/utils/richTextHtmlSanitizer.ts": "Sanitizes rich text HTML by restricting tags, attributes, classes, and styles to a safe allowlist for secure rendering.",
  "frontend/src/utils/sectionPalette.ts": "Provides functions to detect hex and named colors in text and generate variant-based color palettes.",
  "frontend/src/utils/tiptapPasteSanitizer.ts": "Empty or missing file content.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using both query strings and hash routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, layout, animations, and enabling typography, container queries, and animation plugins.",
  "project_state.json": "JSON describing project state, focusing on implementing and enhancing Tiptap image support and related editor features."
}