{
  "backend/main.mo": "Defines data types and state for reviews, articles, bikes, comments, ratings, and includes an admin‑only function to seed popular bike entries.",
  "feature_evidence.json": "Describes feature evidence linking admin-only bike seeding to specific frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten summaries for many frontend files across components and pages.",
  "frontend/index.css": "Tailwind CSS setup defining light/dark theme variables and base styles.",
  "frontend/index.html": "Base HTML entry document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AppFooter.tsx": "Renders the global footer with categories, regions, social links, and attribution.",
  "frontend/src/components/AppHeader.tsx": "Implements the site header with navigation, search, theme toggle, auth actions, and mobile menu.",
  "frontend/src/components/AppLayout.tsx": "Layout wrapper including header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity hooks with error recovery and query cache clearing.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bikes with fields for specs, pricing, images, and region, submitting via mutation hooks.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable selector allowing users to pick a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category cards linking to news, reviews, comparisons, and other sections.",
  "frontend/src/components/CommentsPanel.tsx": "Displays comments for a review with creation, deletion, hiding, and moderation controls.",
  "frontend/src/components/ComparisonTable.tsx": "Compares two bikes and their review scores in a structured table.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Carousel showing recent bike launch articles with title, region, and preview text.",
  "frontend/src/components/ModerationMenu.tsx": "Dropdown menu for owners/admins to hide or delete comments with a confirmation dialog.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal prompting authenticated users without a profile to enter name and optional bio, saving via mutation.",
  "frontend/src/components/RatingWidget.tsx": "Displays average user rating for a review and allows authenticated users to submit a star rating.",
  "frontend/src/components/RegionFilter.tsx": "Tabbed region selector triggering region changes for filtering content.",
  "frontend/src/components/RequireAuthAction.tsx": "Wrapper that blocks actions for unauthenticated users and shows a sign‑in prompt.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows detailed score categories with progress bars and displays an overall score badge.",
  "frontend/src/components/ThemeToggle.tsx": "Button toggling between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns authentication status, user profile, loading state, and admin flag from related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook managing Internet Identity login, stored identity loading, and login state.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating articles, reviews, ratings, and profiles using the backend actor.",
  "frontend/src/index.css": "Tailwind setup defining light and dark theme CSS variables for the UI palette.",
  "frontend/src/main.tsx": "App entry point initializing React, query client, identity provider, and global styles.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Renders a detailed article view by ID with loading, not‑found handling, and full article metadata/content.",
  "frontend/src/pages/BikeDetailPage.tsx": "Displays detailed information for a selected bike, including images, price, region, and navigation with loading and error states.",
  "frontend/src/pages/BrandDetailPage.tsx": "Shows all bikes for a specific brand with loading, empty‑state handling, and a grid of bike cards.",
  "frontend/src/pages/BrandsPage.tsx": "Lists all motorcycle brands with search and counts, grouping bikes by brand and linking to brand detail pages.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Displays a buying guide article with metadata, a checklist section, and full content, including loading and not‑found fallback.",
  "frontend/src/pages/CategoryListingPage.tsx": "Lists articles or reviews for a category with region filtering, loading states, and score badges for reviews.",
  "frontend/src/pages/ComparePage.tsx": "UI for selecting two bikes and displaying a side‑by‑side comparison with specs and reviews.",
  "frontend/src/pages/CreateArticlePage.tsx": "Form page for creating or saving an article draft, handling validation and navigation after submission.",
  "frontend/src/pages/CreateReviewPage.tsx": "Form page for writing a motorcycle review with ratings, bike selection, and draft/publish handling.",
  "frontend/src/pages/HomePage.tsx": "Homepage showing hero content, latest launches, trending bikes, and category navigation fed by fetched data.",
  "frontend/src/pages/ManageBikesPage.tsx": "Management interface for creating, editing, deleting, and optionally seeding bike entries, with admin controls.",
  "frontend/src/pages/MyDraftsPage.tsx": "Displays the user's draft articles and reviews with options to publish or navigate to creation pages.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a detailed review with bike info, score breakdown, comments, and loading/error handling using fetched review and bike data.",
  "frontend/src/pages/SearchResultsPage.tsx": "Fetches articles, reviews, and bikes, filters them based on a search query, groups matching brands, and renders categorized search results.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, store, retrieve, and clear URL and session parameters, including hash-based parsing and persistence.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project metadata, features, known issues, and architectural notes for the application state."
}