{
  "backend/main.mo": "Main canister actor defining types and state for reviews, articles, bikes, comments, ratings, and user profiles with access control and CRUD logic.",
  "backend/migration.mo": "Migration module converting old bike records to a new format by adding priceRange, images, and details fields with defaults.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and test IDs for build traceability.",
  "frontend-file-summaries.txt": "List of short summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind CSS setup defining root theme variables and dark mode overrides with base styling.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Main React router configuration defining all routes and wrapping the app with ThemeProvider and Toaster.",
  "frontend/src/components/AppFooter.tsx": "Footer component showing about text, category/region links, social icons, and Caffeine.ai attribution.",
  "frontend/src/components/AppHeader.tsx": "Top navigation bar with logo, category links, search, and authenticated user actions including drafts, bike management, and article creation.",
  "frontend/src/components/AppLayout.tsx": "Page layout wrapper rendering header, footer, routed content, and profile setup dialog.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button handling Internet Identity authentication and query cache resets.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bike entries with fields for specs, pricing, images, and region.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable selector for choosing a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category cards linking to category pages with icons and descriptions.",
  "frontend/src/components/CommentsPanel.tsx": "Comments section for a review with form submission, listing, and moderation actions.",
  "frontend/src/components/ComparisonTable.tsx": "Displays side‑by‑side bike specifications and review score comparisons.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Carousel showing latest article launches with title, region, preview, and author.",
  "frontend/src/components/ModerationMenu.tsx": "Provides a moderation menu for comments with hide and delete actions, including a confirmation dialog for deletion.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Shows a required profile setup dialog for new authenticated users, allowing them to input name and bio.",
  "frontend/src/components/RatingWidget.tsx": "Displays average user ratings for a review and allows authenticated users to submit their own rating.",
  "frontend/src/components/RegionFilter.tsx": "Renders a tabs-based UI for selecting a region filter and triggers updates on selection changes.",
  "frontend/src/components/RequireAuthAction.tsx": "Wraps actions requiring authentication, prompting unauthenticated users to sign in before proceeding.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows detailed review score categories with progress bars and the overall score badge.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on authentication state and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useCurrentUser.ts": "Retrieves authentication status, user profile, admin status, and related loading states.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity state management with AuthClient integration.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating articles, reviews, ratings, and profiles via the backend actor.",
  "frontend/src/index.css": "Global Tailwind CSS setup defining light/dark theme variables and base styling.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a full article by ID with loading, not‑found handling, and category navigation.",
  "frontend/src/pages/BikeDetailPage.tsx": "Shows detailed motorcycle info by ID including images, region, and price with loading and fallback states.",
  "frontend/src/pages/BrandDetailPage.tsx": "Lists all bikes for a specific brand with loading, not‑found handling, and brand-level navigation.",
  "frontend/src/pages/BrandsPage.tsx": "Displays all motorcycle brands with search filtering and counts of available models.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Shows a buying guide article with metadata, checklist, and navigation back to the buying guides category.",
  "frontend/src/pages/CategoryListingPage.tsx": "Lists articles or reviews for a category with region filtering, loading states, and review scoring display.",
  "frontend/src/pages/ComparePage.tsx": "Provides UI to select two bikes and display a comparison table with specs and reviews.",
  "frontend/src/pages/CreateArticlePage.tsx": "Form page for creating or saving articles with fields for title, content, author, category, and region.",
  "frontend/src/pages/CreateReviewPage.tsx": "Form page for creating or saving motorcycle reviews with bike selection, ratings, and region input.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing hero section, latest launches, trending bikes, and category navigation.",
  "frontend/src/pages/ManageBikesPage.tsx": "Authenticated page to create, edit, and delete user-owned bike listings with a form and list view.",
  "frontend/src/pages/MyDraftsPage.tsx": "Displays and manages the user's draft articles and reviews, including publishing actions.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a detailed review page by fetching reviews and bikes, showing content, specs, scoring, and comments.",
  "frontend/src/pages/SearchResultsPage.tsx": "Fetches articles, reviews, and bikes, filters them by a search query, and displays grouped results with matching brands.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, persisting, and clearing URL and sessionStorage parameters.",
  "frontend/tailwind.config.js": "Configures TailwindCSS theme, colors, animations, container settings, and plugins.",
  "project_state.json": "Stores project metadata including features, issues, schema version, and image requirements."
}