{
  "backend/main.mo": "Defines the backend actor with types, storage, access control, and initial seeding logic for bikes, reviews, articles, comments, and related data.",
  "feature_evidence.json": "Feature evidence report listing feature IDs, affected files, components, and test IDs for recent enhancements.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of many frontend files for reference or tooling.",
  "frontend/.deploy-retry-trigger": "Metadata file indicating a deployment retry attempt with timestamp and reason.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation outlining procedures for handling deployment failures and retry steps.",
  "frontend/index.css": "Global Tailwind CSS setup defining base variables, light/dark themes, and core styles.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in ThemeProvider and Toaster.",
  "frontend/src/components/AppFooter.tsx": "Footer component with about text, category links, region list, social icons, and attribution.",
  "frontend/src/components/AppHeader.tsx": "Header component with navigation links, search bar, region selector, mobile menu, and authentication controls.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with RegionProvider and renders header, footer, and routed content.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button using Internet Identity with state handling and query cache reset.",
  "frontend/src/components/BikeCard.tsx": "Displays a bike card with image, region badge, specs, price, and navigation to the bike detail page.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bikes, managing images, color options, specs parsing, and uploads.",
  "frontend/src/components/BikeImageGallery.tsx": "Interactive image gallery with navigation arrows, thumbnails, error handling, and optional expand action.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable dropdown for selecting a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category cards linking to category pages or comparison page with icons and descriptions.",
  "frontend/src/components/CommentsPanel.tsx": "Displays and manages a comment list for a review, including posting, moderation, and loading states.",
  "frontend/src/components/ComparisonTable.tsx": "Renders a side‑by‑side comparison table of two bikes with specs and optional review score highlights.",
  "frontend/src/components/ImageLightbox.tsx": "Provides a modal image viewer with keyboard navigation, cycling, and error fallback handling.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Shows recent launch articles in a looping carousel with titles, regions, and excerpts.",
  "frontend/src/components/ModerationMenu.tsx": "Dropdown menu allowing owners or admins to hide or delete a comment with confirmation.",
  "frontend/src/components/PaletteSwatchEditDialog.tsx": "Dialog for editing a palette swatch’s hex color with validation and live preview.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to set up their profile by submitting name and optional bio.",
  "frontend/src/components/RatingWidget.tsx": "Displays average rating and lets authenticated users submit a star rating for a review.",
  "frontend/src/components/RegionFilter.tsx": "Renders region selection tabs and notifies parent when the selected region changes.",
  "frontend/src/components/RequireAuthAction.tsx": "Wraps an action and prompts users to sign in if they are not authenticated.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows detailed score categories with progress bars and an overall score badge.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Exposes authentication state, user profile, and admin role based on Internet Identity and queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides identity management, login, logout, and status handling for Internet Identity.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating articles, reviews, and related backend data.",
  "frontend/src/hooks/useRegionContext.tsx": "Stores and persists the selected region in context and sessionStorage.",
  "frontend/src/index.css": "Configures Tailwind base styles and custom theming for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the app with ReactDOM, query client, and the identity provider.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays full article details, handling loading, missing state, and navigation back to its category.",
  "frontend/src/pages/BikeDetailPage.tsx": "Displays detailed bike info, handles invalid IDs, loads images, and supports color-based image selection with a lightbox.",
  "frontend/src/pages/BrandDetailPage.tsx": "Shows all bikes for a specific brand, including brand logo, with loading and empty states.",
  "frontend/src/pages/BrandsPage.tsx": "Generates a searchable list of motorcycle brands grouped from all bikes, including logos and counts.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Loads and displays a specific buying guide article with metadata, checklist, and fallback for missing guides.",
  "frontend/src/pages/CategoryListingPage.tsx": "Lists articles or reviews for a category with region filtering, sorting, and loading or empty states.",
  "frontend/src/pages/ComparePage.tsx": "Allows selecting two bikes and displays a comparison table with specs and related reviews.",
  "frontend/src/pages/CreateArticlePage.tsx": "Provides a form for authenticated users to create or save an article with title, author, content, category, and region, then navigates to the article or drafts page.",
  "frontend/src/pages/CreateReviewPage.tsx": "Allows authenticated users to create or save a motorcycle review with ratings and bike selection, then redirects to the review or drafts page.",
  "frontend/src/pages/HomePage.tsx": "Displays homepage content including trending reviews, latest launches, hero section, and category navigation using fetched articles, bikes, and reviews.",
  "frontend/src/pages/ManageBikesPage.tsx": "Enables authenticated users to create, edit, delete, and seed motorcycle listings, with dialogs and a bike form for management.",
  "frontend/src/pages/MyDraftsPage.tsx": "Shows authenticated users their draft articles and reviews, with options to publish or create new content.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a full review with bike info, scores, comments, and loading/error states.",
  "frontend/src/pages/SearchResultsPage.tsx": "Aggregates search results across articles, reviews, and bikes, with optional brand grouping.",
  "frontend/src/pages/SectionPalettesPage.tsx": "Lets users create text-based sections and generate or edit color palettes extracted from the text.",
  "frontend/src/utils/markdownSpecs.ts": "Parses Markdown spec tables to extract formatted specs text, price ranges, and color lists.",
  "frontend/src/utils/sectionPalette.ts": "Provides utilities to detect colors in text and generate palettes, including hex/name extraction and variants.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing), persisting them in sessionStorage, and clearing them from the URL or storage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining content paths, theme extensions, custom colors, animations, and plugins.",
  "project_state.json": "Defines the project’s state, issues, and feature requests related to markdown price parsing and editable color palettes."
}