{
  "backend/main.mo": "Main actor defining types and state for reviews, articles, bikes, comments, ratings, and admin‑protected operations, including storage and authorization mixins.",
  "backend/migration.mo": "Migration module converting old review data to the new structure by adding pros, cons, rating, and defaulting missing contentType to news.",
  "feature_evidence.json": "Feature evidence report mapping frontend files to implemented requirements for contentType handling, conditional review fields, and pros/cons/rating persistence.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, pages, and UI elements.",
  "frontend/.deploy-retry-trigger": "Metadata file indicating a deployment retry was triggered due to a prior platform error.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation outlining steps for retrying failed deployments and post‑success validation procedures.",
  "frontend/index.css": "Tailwind CSS setup defining global color variables and theme styles for light and dark modes.",
  "frontend/index.html": "Base HTML template loading the React application root and main script.",
  "frontend/src/App.tsx": "Main React app configuring routes with TanStack Router and wrapping the UI in theme and toast providers.",
  "frontend/src/components/AppFooter.tsx": "Renders the site footer with about text, category links, region list, social icons, and a dynamic copyright.",
  "frontend/src/components/AppHeader.tsx": "Implements the main header with navigation, search, region selector, mobile menu, and auth controls.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with region context and renders the header, footer, main outlet, and profile setup dialog.",
  "frontend/src/components/AuthButton.tsx": "Provides a login/logout button using Internet Identity with query cache clearing on logout.",
  "frontend/src/components/BikeCard.tsx": "Displays a bike preview card with image, region badge, specs, price range, and navigation to details.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bikes with fields for specs, images, colors, pricing, and validation logic.",
  "frontend/src/components/BikeImageGallery.tsx": "Image gallery with navigation arrows, thumbnails, error fallback, and optional expand callback.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable selector allowing users to pick a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Renders a grid of category cards linking to category or comparison pages, each with icon and description.",
  "frontend/src/components/CommentsPanel.tsx": "Displays comments for a review with posting, deletion, hiding, and moderation capabilities.",
  "frontend/src/components/ComparisonTable.tsx": "Shows side‑by‑side bike specifications and review-based score comparisons in a table layout.",
  "frontend/src/components/ImageLightbox.tsx": "Provides a modal image viewer with navigation, keyboard controls, and error fallback handling.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Displays recent launch articles in a carousel with title, region badge, excerpt, and link.",
  "frontend/src/components/LongFormContent.tsx": "Parses long-form text into headings and paragraphs and renders it with styled prose.",
  "frontend/src/components/MobileToc.tsx": "Renders a collapsible mobile table of contents highlighting and navigating to headings.",
  "frontend/src/components/ModerationMenu.tsx": "Provides dropdown actions for hiding or deleting comments with confirmation dialog.",
  "frontend/src/components/PaletteSwatchEditDialog.tsx": "Dialog for editing a hex color swatch with validation and preview before saving.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Forces new authenticated users to enter name and optional bio before continuing.",
  "frontend/src/components/RatingWidget.tsx": "Displays average user rating for a review and allows authenticated users to submit ratings.",
  "frontend/src/components/RegionFilter.tsx": "Provides tab-based region selection and notifies parent on changes.",
  "frontend/src/components/RequireAuthAction.tsx": "Wraps children and prompts unauthenticated users to sign in before performing an action.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows detailed category scores and overall score using progress bars.",
  "frontend/src/components/TableOfContents.tsx": "Renders a clickable nested table of contents highlighting the active heading.",
  "frontend/src/components/ThemeToggle.tsx": "Button to toggle between light and dark themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity and refreshes dependent queries.",
  "frontend/src/hooks/useCurrentUser.ts": "Returns authentication state, user profile, and admin role info based on current identity.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity login, logout, and identity management through a React context.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for fetching and mutating articles, reviews, bikes, and related content via an actor API, including publishing, deleting, and error handling.",
  "frontend/src/hooks/useRegionContext.tsx": "Implements a React context for storing and updating the selected region with sessionStorage persistence.",
  "frontend/src/hooks/useTableOfContents.ts": "Extracts headings from content, tracks the active heading via IntersectionObserver, and exposes a scroll-to-heading helper.",
  "frontend/src/index.css": "Configures Tailwind layers and defines light/dark CSS variable themes, global styles, and smooth scrolling behavior.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article with metadata, content, and a responsive table of contents, handling loading and not-found states.",
  "frontend/src/pages/BikeDetailPage.tsx": "Shows detailed bike info including images, pricing, and color options with lightbox support, and handles invalid or missing IDs.",
  "frontend/src/pages/BrandDetailPage.tsx": "Lists all bikes for a specific brand with logo display, loading states, and fallbacks when no bikes are found.",
  "frontend/src/pages/BrandsPage.tsx": "Builds a searchable list of motorcycle brands by aggregating bikes, extracting logos, and rendering brand cards with loading states.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Loads and displays a specific buying guide with metadata, long‑form content, and a table of contents with desktop and mobile variants.",
  "frontend/src/pages/CategoryListingPage.tsx": "Displays articles or reviews for a given category with region filtering, loading states, and per‑item badges and scores.",
  "frontend/src/pages/ComparePage.tsx": "Lets users select two bikes and optionally shows a comparison table using bike and review data.",
  "frontend/src/pages/CreateArticlePage.tsx": "Provides a form for creating or saving articles with category, region, and content‑type selection and navigation after submission.",
  "frontend/src/pages/CreateReviewPage.tsx": "Provides a review‑creation form including bike selection, region, ratings, pros/cons parsing, and submission handling.",
  "frontend/src/pages/HomePage.tsx": "Home page fetching reviews, bikes, and articles to display trending reviews, latest launches, and category navigation sections.",
  "frontend/src/pages/ManageBikesPage.tsx": "Admin/user interface for creating, editing, deleting, and seeding bike listings with authentication and dialogs.",
  "frontend/src/pages/MyDraftsPage.tsx": "Shows authenticated users their draft articles and reviews with options to publish or create new content.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a detailed motorcycle review with bike info, TOC navigation, scores, content, and comments.",
  "frontend/src/pages/SearchResultsPage.tsx": "Search page that scans articles, reviews, and bikes, grouping matches and highlighting matching brands.",
  "frontend/src/pages/SectionPalettesPage.tsx": "React page for creating text-based sections and generating, editing, and managing color palettes extracted from the text.",
  "frontend/src/utils/markdownSpecs.ts": "Parses Markdown spec tables to extract specs text plus optional price ranges and color lists.",
  "frontend/src/utils/reviewFields.ts": "Utility helpers for converting pros/cons and ratings between textarea strings and structured values.",
  "frontend/src/utils/sectionPalette.ts": "Detects color names and hex codes in text and generates deduplicated palettes with light/dark variants.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL or session parameters, supporting hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, containers, animations, and plugins for the frontend.",
  "project_state.json": "Tracks project schema, feature requirements, and pending requests for adding per-document content types and review fields. Includes architectural notes, known issues, and lists of implemented and pending features."
}