{
  "backend/main.mo": "Defines core data types and state for reviews, articles, bikes, comments, ratings, profiles, and storage with admin‑gated seeding logic.",
  "feature_evidence.json": "Lists feature evidence entries mapping features to affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for numerous frontend React components and pages.",
  "frontend/.deploy-retry-trigger": "Marker file indicating a deployment retry attempt with timestamp and reason.",
  "frontend/DEPLOYMENT_RETRY.md": "Documentation describing procedures for retrying failed deployments and validation steps.",
  "frontend/index.css": "Global Tailwind CSS setup defining light/dark theme CSS variables and base styling.",
  "frontend/index.html": "HTML entry file mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with ThemeProvider and Toaster.",
  "frontend/src/components/AppFooter.tsx": "Renders the site footer with about info, category links, region list, social icons, and attribution.",
  "frontend/src/components/AppHeader.tsx": "Navigation header with logo, categories, search, region selector, auth button, and mobile menu handling.",
  "frontend/src/components/AppLayout.tsx": "Wraps the app with region context and renders header, footer, outlet content, and profile setup dialog.",
  "frontend/src/components/AuthButton.tsx": "Login/logout button tied to Internet Identity with query cache clearing and basic error handling.",
  "frontend/src/components/BikeCard.tsx": "Displays a bike preview card with image, region badge, specs, price range, and navigation to the bike page.",
  "frontend/src/components/BikeForm.tsx": "Form for creating or editing bikes including images, pricing, region, colors, brand logo, and markdown spec parsing.",
  "frontend/src/components/BikeImageGallery.tsx": "Cycling image gallery with navigation arrows, thumbnails, error fallback, and optional expand callback.",
  "frontend/src/components/BikeSelector.tsx": "Popover-based searchable selector for choosing a bike from a list.",
  "frontend/src/components/CategoryGrid.tsx": "Grid of category cards linking to content sections with icons and descriptions.",
  "frontend/src/components/CommentsPanel.tsx": "Displays and manages comments for a review, including posting, listing, and moderation actions.",
  "frontend/src/components/ComparisonTable.tsx": "Shows a side‑by‑side bike comparison table with specs and optional review-based scoring.",
  "frontend/src/components/ImageLightbox.tsx": "Provides a modal image viewer with navigation, keyboard support, and error fallback.",
  "frontend/src/components/LatestLaunchesCarousel.tsx": "Renders a carousel of recent launches with titles, regions, previews, and links to article pages.",
  "frontend/src/components/ModerationMenu.tsx": "Offers admin/owner actions for comments, including hide and delete with confirmation.",
  "frontend/src/components/PaletteSwatchEditDialog.tsx": "Dialog for editing a hex color swatch with validation and live preview.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Prompts new authenticated users to enter name and optional bio before continuing.",
  "frontend/src/components/RatingWidget.tsx": "Displays average user rating for a review and allows authenticated users to rate using stars.",
  "frontend/src/components/RegionFilter.tsx": "Provides a tab-based UI for selecting a content region filter.",
  "frontend/src/components/RequireAuthAction.tsx": "Wraps actions requiring authentication and prompts users to sign in if not authenticated.",
  "frontend/src/components/ScoreBreakdown.tsx": "Shows individual score categories and overall score using progress bars.",
  "frontend/src/components/ThemeToggle.tsx": "Toggles between light and dark themes using next-themes.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor based on Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useCurrentUser.ts": "Provides current user authentication state, profile, and admin role info.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, state persistence, and login/logout handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating articles, reviews, and related data through the backend actor.",
  "frontend/src/hooks/useRegionContext.tsx": "Stores and provides the selected region with sessionStorage persistence.",
  "frontend/src/index.css": "Tailwind CSS setup defining light and dark theme variables and base styles.",
  "frontend/src/main.tsx": "Initializes the React app with query and identity providers.",
  "frontend/src/pages/ArticleDetailPage.tsx": "Displays a single article’s details with loading states and navigation back to its category.",
  "frontend/src/pages/BikeDetailPage.tsx": "Displays detailed motorcycle info, handles invalid IDs, loads images, and supports color-based image selection with a lightbox.",
  "frontend/src/pages/BrandDetailPage.tsx": "Shows all bikes for a specific brand, including brand logo, with loading states and navigation back to the brand list.",
  "frontend/src/pages/BrandsPage.tsx": "Lists all motorcycle brands with search and logo handling, grouping bikes by brand.",
  "frontend/src/pages/BuyingGuideDetailPage.tsx": "Displays a single buying guide with metadata, checklist, and fallback when not found.",
  "frontend/src/pages/CategoryListingPage.tsx": "Lists articles or reviews by category and region with filtering, loading states, and review score display.",
  "frontend/src/pages/ComparePage.tsx": "Allows selecting two bikes and displays a side-by-side comparison using specs and reviews.",
  "frontend/src/pages/CreateArticlePage.tsx": "Form page for creating or saving articles with fields, validation, and submit handling.",
  "frontend/src/pages/CreateReviewPage.tsx": "Form page for creating or saving motorcycle reviews with bike selection, scoring sliders, and submit logic.",
  "frontend/src/pages/HomePage.tsx": "Home dashboard showing hero section, latest launches, trending reviews, and category links using fetched data.",
  "frontend/src/pages/ManageBikesPage.tsx": "Authenticated UI for viewing, creating, editing, deleting, and seeding user bike listings.",
  "frontend/src/pages/MyDraftsPage.tsx": "Displays and manages a user's draft articles and reviews with publish actions and fallback prompts.",
  "frontend/src/pages/ReviewDetailPage.tsx": "Displays a single review with bike details, scores, comments, and loading states.",
  "frontend/src/pages/SearchResultsPage.tsx": "Searches articles, reviews, and bikes, grouping matches and showing brand filters.",
  "frontend/src/pages/SectionPalettesPage.tsx": "Manages sections with autogenerated color palettes, allowing adding, editing, and removing colors.",
  "frontend/src/utils/markdownSpecs.ts": "Parses Markdown tables to extract specs text, price ranges, and colors with validation.",
  "frontend/src/utils/sectionPalette.ts": "Detects colors in text and generates hex-based palettes with variants and validation helpers.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading URL parameters (including hash routing) and storing/retrieving them in sessionStorage with optional persistence and cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining theme extensions, custom colors, animations, container settings, and plugin usage.",
  "project_state.json": "Describes the project state, including issues and feature requests to fix Create Bike submission and remove the global color‑palette bar."
}