{
  "kind": "build_request",
  "title": "Improve Tiptap editor image node: resize presets, inline captions, spacing, and mobile responsiveness",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the existing rich-text editor implementation to use the Tiptap editor instance (keeping the existing RichTextEditor component API) and ensure the official Tiptap Image extension is enabled if it is not already present; do not install any libraries beyond the official Tiptap Image extension.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "If not already implemented, create the base image functionality first using the standard Tiptap Image extension.",
          "Do not install new libraries beyond the official Tiptap image extension.",
          "Use existing editor configuration only."
        ]
      },
      "acceptanceCriteria": [
        "RichTextEditor continues to accept `content` and call `onUpdate` with the updated document content.",
        "The editor supports inserting and rendering images using the official Tiptap Image extension (no third-party image extensions).",
        "No new non-Tiptap libraries are added; only the official Tiptap Image extension may be added if missing."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement an image node schema that supports (a) a resize preset and (b) an optional caption stored within the editor document (not in a separate database field), with inline editing of the caption directly below the image.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Captions should: Be editable inline below each image",
          "Be stored as part of the image node schema",
          "Save together with the image inside the document structure",
          "Do not create a separate database field for captions."
        ]
      },
      "acceptanceCriteria": [
        "When an image is inserted, it can store a caption value inside the editor document structure.",
        "The caption is editable inline in the editor UI directly below the image.",
        "Saving/loading the editor content preserves the image caption without requiring any separate persistence field.",
        "Captions are optional and can be left empty without rendering visual artifacts (e.g., no empty placeholder caption shown when blank)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a lightweight contextual image menu that appears when the user clicks/selects an image, offering three preset width options: Small, Medium, Full Width. Selecting an option applies CSS classes only: `img-small`, `img-medium`, `img-full`. Do not implement drag resizing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Resize options should be selected via a small contextual image menu that appears when the image is clicked.",
          "Show options: Small Medium Full Width",
          "Apply resize using CSS classes only (no heavy logic). Example: img-small img-medium img-full",
          "Do not implement drag resizing."
        ]
      },
      "acceptanceCriteria": [
        "Clicking an image shows a small contextual menu near the image (or selection) with buttons/controls: Small, Medium, Full Width.",
        "Choosing a size applies exactly one of: `img-small`, `img-medium`, `img-full` to the rendered image container/element via editor node attributes -> DOM rendering.",
        "No drag handles or mouse-driven resizing is implemented.",
        "The chosen size persists in saved content and is restored correctly when content is reloaded."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure images have proper spacing above and below, and implement responsive mobile behavior so images render cleanly on narrow screens (lightweight CSS-based solution; no heavy runtime layout logic).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1",
          "msg-2"
        ],
        "quotes": [
          "Proper spacing above and below images",
          "Responsive behavior on mobile",
          "Keep implementation lightweight."
        ]
      },
      "acceptanceCriteria": [
        "Images in the editor and in rendered content have consistent vertical spacing from surrounding paragraphs/headings.",
        "On mobile/narrow widths, images do not overflow the content area and remain readable; widths adapt appropriately (e.g., full width on small screens even if set to small/medium, if needed).",
        "The solution is implemented primarily through CSS/Tailwind and existing editor rendering hooks, without complex runtime calculations."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Update HTML sanitization used for rendering stored rich-text so that the image sizing classes and caption markup produced by the editor are preserved (while still sanitizing unsafe tags/attributes).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Be stored as part of the image node schema",
          "Apply resize using CSS classes only"
        ]
      },
      "acceptanceCriteria": [
        "Content rendered via the existing sanitizer preserves the image sizing classes (`img-small`, `img-medium`, `img-full`) and any required safe attributes needed to render captions.",
        "Unsafe attributes continue to be removed as before; existing non-image formatting still renders correctly.",
        "No new libraries are introduced for sanitization."
      ]
    }
  ],
  "constraints": [
    "Do not install new libraries, except the official Tiptap Image extension if it is not already installed.",
    "Do not implement drag-based image resizing.",
    "Keep the implementation lightweight and within the existing editor configuration.",
    "Do not create a separate database field for image captions; captions must live inside the editor document/content."
  ],
  "nonGoals": [
    "Adding image optimization, compression, or external image hosting/CDN integration.",
    "Implementing real-time collaboration or multi-user editing.",
    "Adding complex image editing features (crop, rotate, filters)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}