{
  "kind": "build_request",
  "title": "Fix Create Bike submission and remove global palette bar (keep BikeForm palette)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the Create Bike flow so that clicking the “Create Bike” submit button successfully creates a new bike entry and the new bike appears in the user’s bike list (Manage Bikes page) instead of showing an “action not available” error.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when adding all the details, then i click on create bike it saying action not available.",
          "“action not available” after clicking Create Bike. simple the bike should be created. it submit the form and create a new bike entry in your system."
        ]
      },
      "acceptanceCriteria": [
        "As an authenticated user on /manage-bikes, filling out the Create New Bike form and submitting results in a successful backend createBike call and returns a bike id.",
        "After successful creation, the Manage Bikes list refreshes and includes the newly created bike without requiring a manual page refresh.",
        "If creation fails (e.g., unauthorized or actor not ready), the UI shows a clear error message explaining the cause (not a generic “action not available”) and does not close the form."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove the color-palette detection bar/UI element from the top of the website (global header/top-of-page area), while keeping the AI palette functionality inside the bike creation/edit form (BikeForm) unchanged and available.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "and remove the palette from the top of the website.",
          "The colour-palette detection bar we previously added, but don't need to remove the AI palette we have on the bike form."
        ]
      },
      "acceptanceCriteria": [
        "No palette detection bar or palette-related UI is visible in the site-wide header/top-of-page area across pages.",
        "The BikeForm still shows its palette-related functionality (no regression in the bike form palette UI/features)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui or any paths listed as immutable in SYSTEM_CONTEXT.",
    "Backend changes must remain within the single Motoko actor (backend/main.mo); only add backend/migration.mo if an actual state migration is required."
  ],
  "nonGoals": [
    "Do not remove or redesign the AI palette feature within the BikeForm.",
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not add new bike-related features beyond fixing the create submission and removing the global palette bar."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}