{
  "kind": "build_request",
  "title": "Fix Markdown price parsing and enable editing existing color swatches",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix Markdown table ingestion so MSRP/price values are detected and auto-filled even when the left-column label contains extra text (e.g., \"MSRP (Global Est.)\"). The parser must successfully extract the currency range from values like \"$19,500 – $21,000 USD\" and populate the existing min/max price fields.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "when i add the markdown table its not filling the prices",
          "| MSRP (Global Est.) | $19,500 – $21,000 USD |"
        ]
      },
      "acceptanceCriteria": [
        "Pasting the provided Markdown table into the BikeForm \"Paste Specs\" area and clicking Apply sets both Min Price and Max Price based on the MSRP row.",
        "The MSRP row is detected when the key includes text like \"MSRP (Global Est.)\" (i.e., matching is not limited to exact equality with \"msrp\").",
        "Price extraction works with commas, currency symbols, en-dashes/em-dashes, and trailing currency codes (e.g., USD).",
        "If no price row is present, existing price inputs remain unchanged."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Allow users to edit an existing per-section color palette after creation by clicking an existing color swatch and updating it to a new hex color value (instead of the palette becoming locked/uneditable).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "users be able to click an existing colour swatch and edit it",
          "the pallets are getting locked when coluir are added"
        ]
      },
      "acceptanceCriteria": [
        "On the Section Palettes page, clicking an existing displayed palette color opens an edit UI (e.g., dialog/popover) that lets the user enter/select a new hex color.",
        "Saving the edit replaces only the clicked color entry in that section’s palette (no unintended regeneration of the palette).",
        "Edited values are validated/normalized to a 6-digit hex code (consistent with existing validation behavior).",
        "The existing remove-color control continues to work for each palette color."
      ]
    }
  ],
  "constraints": [
    "Use English for any user-facing text.",
    "Do not modify files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT.",
    "Keep all backend logic in backend/main.mo; do not introduce additional backend services."
  ],
  "nonGoals": [
    "Do not add new authentication providers beyond Internet Identity.",
    "Do not change the rule that palettes auto-generate only when a section is created (editing text should not automatically regenerate palettes).",
    "Do not introduce external databases or third-party APIs."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}