{
  "kind": "build_request",
  "title": "Add admin-triggered sample bike seeding (predefined popular models)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Add a backend admin-only method that seeds (inserts) a predefined list of sample/popular bike entries into the existing Bikes store, without requiring any file upload.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "automatic sample bikes added (predefined popular models)",
          "do it"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a new shared method (e.g., seedSampleBikes) callable only by admins; non-admin callers receive an Unauthorized-style error.",
        "The method inserts multiple predefined Bike records (with name, brand, specs, priceRange, images, details, region) using the existing Bike schema.",
        "The method is safe to call more than once (it does not create duplicate bikes for the same predefined entries; duplicates are skipped or otherwise prevented).",
        "The method returns a useful result (e.g., number of bikes inserted) or otherwise provides an unambiguous success response."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Expose the sample-bike seeding capability in the frontend as an admin-only action, and refresh bike listings after seeding completes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "bulk/sample bike support",
          "automatic sample bikes added (predefined popular models)"
        ]
      },
      "acceptanceCriteria": [
        "React Query includes a new mutation hook to call the backend sample seeding method, with appropriate error handling and success messaging in English.",
        "The UI shows a clearly labeled admin-only control (e.g., a button on the Manage Bikes page) to trigger sample seeding; non-admin authenticated users and unauthenticated users do not see it.",
        "Triggering the action shows a confirmation step before inserting the sample bikes.",
        "On success, the frontend invalidates/refetches relevant queries so that newly seeded bikes appear without a manual refresh (at minimum: the public bikes query and the user/admin bikes management list where applicable).",
        "If the backend rejects the call as unauthorized, the UI displays a clear English error message and does not modify the UI state."
      ]
    }
  ],
  "constraints": [
    "Do not implement CSV/JSON upload or any file-based bulk import flow; sample bikes must be inserted from a predefined list.",
    "Respect the single-actor Motoko backend architecture (all logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any other frontend immutablePaths."
  ],
  "nonGoals": [
    "Building a general-purpose bulk import pipeline (CSV/JSON parsing, drag-and-drop upload, etc.).",
    "Adding external databases or third-party integrations to store or source sample bikes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}