{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tiptap image node improvements: presets, captions, spacing, responsive rendering, and sanitizer updates",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Replace the current contentEditable-based editor with a Tiptap editor instance while preserving the RichTextEditor component API and enabling the official Tiptap Image extension.",
      "acceptanceCriteria": [
        "RichTextEditor continues to accept `content` and call `onUpdate` with the updated document content.",
        "The editor supports inserting and rendering images using the official Tiptap Image extension (no third-party image extensions).",
        "No new non-Tiptap libraries are added; only the official Tiptap Image extension may be added if missing."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RichTextEditor.tsx",
          "operation": "modify",
          "description": "Refactor RichTextEditor to use a Tiptap editor instance (keeping the existing `content`/`onUpdate` API), including existing formatting controls and paste sanitization hooks; ensure the official `@tiptap/extension-image` is included in the editor configuration for image rendering/insertion."
        },
        {
          "path": "frontend/package.json",
          "operation": "modify",
          "description": "If not already present, add the official Tiptap Image extension dependency (`@tiptap/extension-image`) only; do not add any other new libraries."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Implement a Tiptap image node that stores a resize preset and optional inline caption inside the document and supports editing the caption directly below the image.",
      "acceptanceCriteria": [
        "When an image is inserted, it can store a caption value inside the editor document structure.",
        "The caption is editable inline in the editor UI directly below the image.",
        "Saving/loading the editor content preserves the image caption without requiring any separate persistence field.",
        "Captions are optional and can be left empty without rendering visual artifacts (e.g., no empty placeholder caption shown when blank)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/tiptap/extensions/ImageWithCaption.tsx",
          "operation": "create",
          "description": "Create a custom Tiptap node (built on/compatible with the official Tiptap Image extension) that adds node attributes for `sizePreset` and `caption`, renders an image wrapper plus caption markup, and uses a NodeView to allow inline caption editing directly beneath the image."
        },
        {
          "path": "frontend/src/components/RichTextEditor.tsx",
          "operation": "modify",
          "description": "Register and use the custom ImageWithCaption extension in the editor configuration so inserted images carry `caption` and `sizePreset` in-document and captions can be edited inline beneath the image."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a contextual image menu on image selection with preset width options that apply only the CSS classes img-small, img-medium, or img-full (no drag resizing).",
      "acceptanceCriteria": [
        "Clicking an image shows a small contextual menu near the image (or selection) with buttons/controls: Small, Medium, Full Width.",
        "Choosing a size applies exactly one of: `img-small`, `img-medium`, `img-full` to the rendered image container/element via editor node attributes -> DOM rendering.",
        "No drag handles or mouse-driven resizing is implemented.",
        "The chosen size persists in saved content and is restored correctly when content is reloaded."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/RichTextEditor.tsx",
          "operation": "modify",
          "description": "Implement a lightweight contextual image menu (e.g., Tiptap BubbleMenu/Floating UI anchored to selection) that appears when the image node is selected and updates the image node attribute used to render exactly one sizing class: `img-small`, `img-medium`, or `img-full`."
        },
        {
          "path": "frontend/src/tiptap/extensions/ImageWithCaption.tsx",
          "operation": "modify",
          "description": "Ensure the image node rendering maps the stored preset attribute to DOM output that includes exactly one class from `img-small`, `img-medium`, `img-full`, and that the attribute is preserved in HTML serialization/parsing so it round-trips through saved content."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add consistent vertical spacing and CSS-based responsive behavior so images render cleanly on narrow screens without runtime layout logic.",
      "acceptanceCriteria": [
        "Images in the editor and in rendered content have consistent vertical spacing from surrounding paragraphs/headings.",
        "On mobile/narrow widths, images do not overflow the content area and remain readable; widths adapt appropriately (e.g., full width on small screens even if set to small/medium, if needed).",
        "The solution is implemented primarily through CSS/Tailwind and existing editor rendering hooks, without complex runtime calculations."
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add lightweight CSS rules for the editor and rendered prose content to style the image wrapper and caption (spacing above/below), define the sizing classes `img-small`, `img-medium`, `img-full`, and add mobile-responsive overrides to prevent overflow and keep images readable on narrow screens."
        },
        {
          "path": "frontend/src/tiptap/extensions/ImageWithCaption.tsx",
          "operation": "modify",
          "description": "Align the node’s HTML structure/classes with the global CSS expectations (wrapper element + image + optional caption) so spacing/responsive behaviors apply consistently both in-editor and when rendering stored content."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Update the existing HTML sanitizer so image sizing classes and caption markup produced by the editor are preserved while continuing to strip unsafe tags/attributes.",
      "acceptanceCriteria": [
        "Content rendered via the existing sanitizer preserves the image sizing classes (`img-small`, `img-medium`, `img-full`) and any required safe attributes needed to render captions.",
        "Unsafe attributes continue to be removed as before; existing non-image formatting still renders correctly.",
        "No new libraries are introduced for sanitization."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/richTextHtmlSanitizer.ts",
          "operation": "modify",
          "description": "Extend the sanitizer allowlist to preserve the image caption markup produced by the editor (e.g., figure/figcaption or equivalent) and preserve safe `class` attributes needed for `img-small`, `img-medium`, `img-full` on the relevant elements, while maintaining existing unsafe tag/attribute stripping behavior and without adding new sanitization libraries."
        },
        {
          "path": "frontend/src/components/LongFormContent.tsx",
          "operation": "modify",
          "description": "Ensure rendered rich-text continues to route through the updated sanitizer and that the sanitized output supports the editor-produced image wrapper/caption structure and sizing classes in final display."
        }
      ]
    }
  ]
}