{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Admin-only sample bike seeding control (frontend)",
  "requirements": [
    {
      "id": "REQ-29",
      "summary": "Add an admin-only UI control to trigger backend sample-bike seeding via a React Query mutation, with confirmation, error handling, and post-success query refresh.",
      "acceptanceCriteria": [
        "React Query includes a new mutation hook to call the backend sample seeding method, with appropriate error handling and success messaging in English.",
        "The UI shows a clearly labeled admin-only control (e.g., a button on the Manage Bikes page) to trigger sample seeding; non-admin authenticated users and unauthenticated users do not see it.",
        "Triggering the action shows a confirmation step before inserting the sample bikes.",
        "On success, the frontend invalidates/refetches relevant queries so that newly seeded bikes appear without a manual refresh (at minimum: the public bikes query and the user/admin bikes management list where applicable).",
        "If the backend rejects the call as unauthorized, the UI displays a clear English error message and does not modify the UI state."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook (e.g., useSeedPopularBikeEntries) that calls actor.seedPopularBikeEntries(), shows English success messaging, and on success invalidates/refetches at minimum ['bikes'] and ['userBikes']. Ensure robust error handling: if the thrown message includes 'Unauthorized', surface a clear English admin-only error. Verify the component's usage instructions before implementing. (Uses authorization capability via existing admin detection patterns in the app.)"
        },
        {
          "path": "frontend/src/pages/ManageBikesPage.tsx",
          "operation": "modify",
          "description": "Expose an admin-only 'Seed sample bikes' action on the Manage Bikes page: use the existing authorization system's admin role signal (e.g., useCurrentUser().isAdmin) to hide the control for non-admin and unauthenticated users. Add a confirmation step (use existing AlertDialog UI already used on this page) before triggering the seed mutation. On confirm, call the new mutation hook; while running, disable the control and prevent duplicate clicks; on success rely on query invalidation so newly seeded bikes appear without manual refresh. If unauthorized, display a clear English error and do not alter local UI state beyond closing/canceling the dialog as appropriate. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}