{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Create Bike submission reliability and remove global palette header UI",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Create Bike submission reliably call createBike, show actionable errors, and refresh Manage Bikes list to include the new bike.",
      "acceptanceCriteria": [
        "As an authenticated user on /manage-bikes, filling out the Create New Bike form and submitting results in a successful backend createBike call and returns a bike id.",
        "After successful creation, the Manage Bikes list refreshes and includes the newly created bike without requiring a manual page refresh.",
        "If creation fails (e.g., unauthorized or actor not ready), the UI shows a clear error message explaining the cause (not a generic “action not available”) and does not close the form."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the bike create mutation: ensure failures are surfaced with clear, user-actionable messages (e.g., distinguish unauthorized vs actor not available/initializing vs other errors) and ensure cache invalidation for the Manage Bikes list happens reliably after a successful create. Use the authorization component’s frontend guidance to handle authentication-dependent data access and error handling gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BikeForm.tsx",
          "operation": "modify",
          "description": "Update the Create Bike submit handling to (1) await the create mutation result (bike id) for success confirmation, (2) keep the form open on failure, and (3) render a clear inline error message on failures such as unauthorized or actor not ready (instead of generic copy). Maintain existing in-form palette functionality unchanged. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ManageBikesPage.tsx",
          "operation": "modify",
          "description": "Ensure the Manage Bikes list reflects newly created bikes immediately after form success (e.g., by explicitly triggering a refetch/invalidation of the user bike list when the form closes on success, guarding against any race with query invalidation). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove the palette detection bar/UI from the global header while keeping BikeForm palette features intact.",
      "acceptanceCriteria": [
        "No palette detection bar or palette-related UI is visible in the site-wide header/top-of-page area across pages.",
        "The BikeForm still shows its palette-related functionality (no regression in the bike form palette UI/features)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AppHeader.tsx",
          "operation": "modify",
          "description": "Remove any palette detection bar / palette-related UI rendered in the global header/top-of-page area (including related icons, controls, state, or components) while keeping normal navigation intact. Do not change BikeForm palette features. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}