{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Markdown MSRP parsing and enable editing section palette swatches",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Make Markdown table ingestion detect MSRP/price rows with non-exact labels and reliably extract min/max prices from common currency range formats.",
      "acceptanceCriteria": [
        "Pasting the provided Markdown table into the BikeForm \"Paste Specs\" area and clicking Apply sets both Min Price and Max Price based on the MSRP row.",
        "The MSRP row is detected when the key includes text like \"MSRP (Global Est.)\" (i.e., matching is not limited to exact equality with \"msrp\").",
        "Price extraction works with commas, currency symbols, en-dashes/em-dashes, and trailing currency codes (e.g., USD).",
        "If no price row is present, existing price inputs remain unchanged."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/markdownSpecs.ts",
          "operation": "modify",
          "description": "Update MSRP/price row detection to use robust matching (e.g., key normalization + substring/keyword checks) so labels like \"MSRP (Global Est.)\" are recognized; strengthen price parsing to tolerate trailing currency codes and dash variants while still returning correct numeric min/max for ranges like \"$19,500 – $21,000 USD\"."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Enable editing an existing section palette swatch by clicking it and updating its hex value without regenerating the palette.",
      "acceptanceCriteria": [
        "On the Section Palettes page, clicking an existing displayed palette color opens an edit UI (e.g., dialog/popover) that lets the user enter/select a new hex color.",
        "Saving the edit replaces only the clicked color entry in that section’s palette (no unintended regeneration of the palette).",
        "Edited values are validated/normalized to a 6-digit hex code (consistent with existing validation behavior).",
        "The existing remove-color control continues to work for each palette color."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PaletteSwatchEditDialog.tsx",
          "operation": "create",
          "description": "Create a reusable edit dialog component for updating a single palette color using shadcn-ui dialog/input/button building blocks (verify the component's usage instructions before implementing). The component should accept current color, handle hex input, call existing validateHexColor for normalization, and return the updated color on save."
        },
        {
          "path": "frontend/src/pages/SectionPalettesPage.tsx",
          "operation": "modify",
          "description": "Wire swatch click to open the new PaletteSwatchEditDialog, track which section/color is being edited, and on save replace only the clicked color value in that section’s palette array (no palette regeneration). Ensure the existing remove-color button still works by preventing click propagation from the remove control to the edit action."
        }
      ]
    }
  ]
}