{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Review-only contentType + Pros/Cons/Rating UI and save/load wiring",
  "requirements": [
    {
      "id": "REQ-4",
      "summary": "Add a content type dropdown (News/Review) in the editor toolbar area and keep it persisted per document via the existing save/load flow.",
      "acceptanceCriteria": [
        "The editor UI shows a content type dropdown with exactly two options: News and Review.",
        "The default selection for new documents is News.",
        "When a saved document is loaded, the dropdown reflects the stored `contentType`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreateReviewPage.tsx",
          "operation": "modify",
          "description": "Ensure the Content Type dropdown is presented prominently in the page’s top editing controls (toolbar area) with exactly `News` and `Review`, defaulting to `news`, and that its value is included in the save payload and restored from loaded document data when editing/rehydrating. Use existing shadcn-ui Select components (Select/SelectTrigger/SelectContent/SelectItem) for the dropdown. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Conditionally render Pros/Cons/Rating form fields outside the editor content area when contentType is Review, and hide them for News, updating immediately on dropdown changes and on load.",
      "acceptanceCriteria": [
        "Pros/Cons/Rating fields are rendered only when `contentType` is `review` and are not part of the rich-text editor schema.",
        "Switching the dropdown between News and Review shows/hides the fields immediately without animation complexity.",
        "Loading a document with `contentType = review` shows the fields populated from stored values; loading with `news` hides them."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CreateReviewPage.tsx",
          "operation": "modify",
          "description": "Add three simple form fields outside the main content textarea (no custom editor nodes; keep as plain form fields): Pros (Textarea), Cons (Textarea), Rating (number Input). Render them only when `contentType === 'review'`, hide otherwise, and update visibility immediately on dropdown change and when initial document values are set. Use existing shadcn-ui Input/Textarea/Label components to match app styling. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Persist Pros/Cons/Rating on save and restore them on load; serialize/deserialize pros/cons between textarea and string arrays deterministically.",
      "acceptanceCriteria": [
        "Saving a review-type document writes `pros`, `cons`, and `rating` to the backend and they are returned on subsequent loads.",
        "`pros`/`cons` are stored as arrays in the backend interface; frontend converts to/from textarea content deterministically (no data loss across save/load).",
        "For news-type documents, saving does not require Pros/Cons/Rating to be present; defaults are used when absent."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/reviewFields.ts",
          "operation": "create",
          "description": "Add deterministic helpers for serializing/deserializing review pros/cons between textarea strings and backend arrays (e.g., split on newlines, trim each line, filter empty; join arrays with `\\n`). Include rating normalization helper (coerce to number, default to 0 when empty/invalid)."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update `useCreateOrSaveReview` mutation variables to include `pros: string[]`, `cons: string[]`, and `rating: number`, and pass them to the backend actor call. Ensure defaults are applied in the mutation function for missing values (pros/cons default to empty arrays; rating defaults to 0; contentType defaults to `news` if not provided)."
        },
        {
          "path": "frontend/src/pages/CreateReviewPage.tsx",
          "operation": "modify",
          "description": "Wire Pros/Cons/Rating UI state into the save flow by converting textarea values to arrays using the new utils and sending them through `useCreateOrSaveReview`. On initialization (new document), default pros/cons to empty and rating to 0; ensure switching to `news` does not require these fields (keep state but omit or send defaults). Use existing shadcn-ui components for inputs. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}